Repository: xjxtree/agent-pet-companion
Catalog: apps/macos/Sources/AgentPetCompanion/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# overlay.activity.plan
source: Updating the plan
zh_hans: 正在更新计划

# overlay.activity.search
source: Searching
zh_hans: 正在搜索

# overlay.activity.subagent
source: Coordinating a sub-agent
zh_hans: 正在协调子 Agent

# overlay.activity.thinking
source: Thinking
zh_hans: 正在思考

# overlay.activity.tool
source: Using a tool
zh_hans: 正在调用工具

# overlay.bubble.close_accessibility
source: Close session bubble
zh_hans: 关闭会话气泡

# overlay.bubble.close_hint
source: Hides this session bubble without closing the Agent session
zh_hans: 隐藏此会话气泡，但不会关闭 Agent 会话

# overlay.bubble.collapse
source: Collapse Bubble
zh_hans: 收起气泡

# overlay.bubble.count_format
source: %@, %d sessions
zh_hans: %@，共 %d 个会话

# overlay.bubble.expand
source: Expand Bubble
zh_hans: 展开气泡

# overlay.detail.blocked
source: The task is blocked. Open the agent for details.
zh_hans: 任务遇到错误，请打开 Agent 查看详情。

# overlay.detail.completed
source: The agent finished the task.
zh_hans: Agent 已完成任务。

# overlay.detail.needs_input
source: Return to the agent to approve, answer, or decide.
zh_hans: 请回到 Agent 完成确认、回答或决策。

# overlay.detail.ready
source: The latest result is complete.
zh_hans: 最新结果已完成。

# overlay.detail.running
source: The task has started.
zh_hans: 任务已开始。

# overlay.help.dismiss
source: Collapse from the list
zh_hans: 从列表收起

# overlay.help.open
source: Open session
zh_hans: 打开会话

# overlay.help.open_and_dismiss
source: Open session and collapse it from the list
zh_hans: 打开会话并从列表收起

# overlay.help.unavailable
source: This session cannot be opened
zh_hans: 当前会话不可打开

# overlay.idle.detail
source: No active agent session.
zh_hans: 暂无活跃 Agent 会话。

# overlay.pet.accessibility
source: Desktop pet
zh_hans: 桌宠

# overlay.pet.accessibility_help
source: Click to expand or collapse the session bubble. Drag with the primary button. Right-click for quick actions.
zh_hans: 单击展开或收起会话气泡；按住左键拖动，右击打开快捷菜单

# overlay.pet.no_pet
source: No desktop pet is enabled
zh_hans: 尚未启用桌宠

# overlay.pet.open_quick_menu
source: Open Quick Actions
zh_hans: 打开快捷菜单

# overlay.session.alias_title_format
source: %@ session %@
zh_hans: %@ 会话 %@

# overlay.session.dismiss
source: Hide This Session
zh_hans: 收起此会话

# overlay.session.navigation_degraded
source: The Agent app opened, but the exact session could not be reached. The message was kept; try again.
zh_hans: 已打开 Agent App，但未能到达对应会话；消息已保留，请重试。

# overlay.session.navigation_failed
source: Couldn’t open this Agent session. The message was kept; check the app and try again.
zh_hans: 未能打开对应 Agent 会话；消息已保留，请检查 App 后重试。

# overlay.session.navigation_unavailable
source: This Agent session cannot be opened. The message was kept.
zh_hans: 当前 Agent 会话不可打开，消息已保留。

# overlay.session.title_format
source: %@ session
zh_hans: %@ 会话

# overlay.sessions.collapse_format
source: Collapse %d sessions
zh_hans: 收起 %d 个会话

# overlay.sessions.expand_format
source: Expand %d sessions
zh_hans: 展开 %d 个会话

# overlay.sessions.more_control_center_format
source: View %d more in Control Center
zh_hans: 在控制中心查看其余 %d 个会话

# overlay.sessions.more_detail_format
source: %d more sessions are available in Control Center
zh_hans: 另有 %d 个会话，可在控制中心查看

# overlay.sessions.more_title
source: More active sessions
zh_hans: 更多活跃会话

# overlay.status.blocked
source: Blocked
zh_hans: 已阻塞

# overlay.status.done
source: Completed
zh_hans: 已完成

# overlay.status.needs_input
source: Needs input
zh_hans: 需要输入

# overlay.status.ready
source: Ready
zh_hans: 待查看

# overlay.status.running
source: Started
zh_hans: 已开始

# overlay.status.tool
source: Using a tool
zh_hans: 执行工具

# petcore.failure.retry_action
source: Retry Startup
zh_hans: 重试启动

# petcore.failure.retrying_accessibility
source: Retrying PetCore startup
zh_hans: 正在重试启动 PetCore

# petcore.failure.retrying_title
source: PetCore failed to start. Retrying…
zh_hans: PetCore 启动失败，正在重试

# petcore.failure.title
source: PetCore failed to start
zh_hans: PetCore 启动失败

# product.action.connect
source: Connect
zh_hans: 连接

# product.action.continue_editing
source: Continue Editing
zh_hans: 继续修改

# product.action.use_pet
source: Use This Pet
zh_hans: 使用这只宠物

# product.action.verify
source: Verify
zh_hans: 验证

# product.attention.all_activity
source: All Activity
zh_hans: 全部活动

# product.attention.custom
source: Custom
zh_hans: 自定义

# product.attention.only_when_needed
source: Only When I Am Needed
zh_hans: 只在需要我时

# product.attention.standard
source: Standard
zh_hans: 标准

# product.connection.checking
source: Checking
zh_hans: 正在检查

# product.connection.connected
source: Connected
zh_hans: 已连接

# product.connection.needs_repair
source: Needs Repair
zh_hans: 需要修复

# product.connection.not_checked
source: Not Checked
zh_hans: 未检查

# product.connection.unavailable
source: Unavailable
zh_hans: 不可用

# product.event.done
source: Completed
zh_hans: 已完成

# product.event.failed
source: Failed
zh_hans: 执行失败

# product.event.plan
source: Planning
zh_hans: 正在规划

# product.event.start
source: Started
zh_hans: 已开始

# product.event.thinking
source: Thinking
zh_hans: 正在思考

# product.event.tool
source: Using Tools
zh_hans: 正在调用工具

# product.event.waiting
source: Waiting for You
zh_hans: 等待你操作

# product.interaction.acknowledge
source: Acknowledge
zh_hans: 回应

# product.interaction.drag_left
source: Drag Left
zh_hans: 向左拖动

# product.interaction.drag_right
source: Drag Right
zh_hans: 向右拖动

# product.lifecycle.done
source: Completed
zh_hans: 已完成

# product.lifecycle.failed
source: Failed
zh_hans: 执行失败

# product.lifecycle.idle
source: Resting
zh_hans: 正在休息

# product.lifecycle.thinking
source: Thinking
zh_hans: 正在思考

# product.lifecycle.tool
source: Using Tools
zh_hans: 正在调用工具

# product.lifecycle.waiting
source: Waiting for You
zh_hans: 等待你操作

# product.navigation.agent_host_format
source: Open %@
zh_hans: 打开 %@

# product.navigation.exact_session
source: Return to Session
zh_hans: 返回会话

# product.navigation.unavailable
source: No safe destination is available
zh_hans: 没有安全可用的跳转目标

# quality.high
source: High
zh_hans: 高清

# quality.high_detail.format
source: %d×%d · Supported for imported packages made by an external producer with sufficient source resolution
zh_hans: %d×%d · 支持导入由具备足够来源分辨率的外部流程制作的宠物包

# quality.low
source: Low
zh_hans: 标清

# quality.low_detail.format
source: %d×%d · Pixel or minimal characters and lower-resource devices
zh_hans: %d×%d · 适合像素、极简角色与低资源设备

# quality.standard
source: Standard
zh_hans: 标准

# quality.standard_detail.format
source: %d×%d · Recommended for most characters
zh_hans: %d×%d · 推荐，适合大多数角色

# service.desktop.disabled
source: Desktop pet display is off
zh_hans: 桌宠显示已关闭

# service.desktop.hidden
source: The desktop pet is not currently visible
zh_hans: 桌宠当前未显示

# service.desktop.running_format
source: %d frames · %@
zh_hans: %d 帧 · %@

# service.event.checking_detail
source: Checking the local event path
zh_hans: 正在检查本地事件链路

# service.event.offline_detail
source: The event channel is unavailable while PetCore is offline
zh_hans: PetCore 离线期间事件通道不可用

# service.event.recent_format
source: Recent activity: %@
zh_hans: 最近活动：%@

# service.event.recovering_detail
source: Waiting for the local event channel to reconnect
zh_hans: 正在等待本地事件通道重新连接

# service.event.runtime_mismatch_detail
source: Events are paused until runtime compatibility is restored
zh_hans: 恢复运行时兼容性后事件通道才会继续工作

# service.event.waiting
source: Waiting for PetCore to reconnect
zh_hans: 等待 PetCore 恢复连接

# service.petcore.checking_detail
source: Checking runtime identity and compatibility
zh_hans: 正在检查运行时身份与兼容性

# service.petcore.failed_detail
source: PetCore is currently unavailable.
zh_hans: PetCore 当前不可用。

# service.petcore.offline_detail
source: PetCore cannot currently be reached on the local transport.
zh_hans: 当前无法通过本地传输连接 PetCore。

# service.petcore.recovering_detail
source: Restarting PetCore and verifying its local runtime
zh_hans: 正在重启 PetCore 并验证本地运行时

# service.petcore.running
source: Running
zh_hans: 运行中

# service.petcore.running_version_format
source: Running · %@
zh_hans: 运行中 · %@

# service.petcore.runtime_mismatch_detail
source: The running PetCore is not compatible with this App build.
zh_hans: 正在运行的 PetCore 与当前 App 构建不兼容。

# service.row.desktop_pet
source: Desktop Pet Rendering
zh_hans: 桌宠渲染

# service.row.event_channel
source: Event Channel
zh_hans: 事件通道

# service.row.local_rpc
source: Local RPC
zh_hans: 本地 RPC

# service.rpc.checking_detail
source: Checking protocol and database compatibility
zh_hans: 正在检查协议与数据库兼容性

# service.rpc.offline_detail
source: The local RPC endpoint is offline
zh_hans: 本地 RPC 端点已离线

# service.rpc.protocol_unknown
source: Protocol unknown
zh_hans: 协议未知

# service.rpc.recovering_detail
source: Waiting for the local RPC endpoint to return
zh_hans: 正在等待本地 RPC 端点恢复

# service.rpc.runtime_mismatch_detail
source: RPC protocol or database compatibility does not match this App
zh_hans: RPC 协议或数据库兼容性与当前 App 不匹配

# service.rpc.schema_unreported
source: Schema not reported
zh_hans: Schema 未报告

# service.rpc.unavailable
source: PetCore is not currently reachable
zh_hans: PetCore 当前不可连接

# service.status.checking
source: Checking
zh_hans: 检查中

# service.status.disabled
source: Off
zh_hans: 已关闭

# service.status.failure
source: Issue
zh_hans: 异常

# service.status.healthy
source: Healthy
zh_hans: 正常

# service.status.hidden
source: Hidden
zh_hans: 已隐藏

# service.status.offline
source: Offline
zh_hans: 离线

# service.status.online
source: Online
zh_hans: 在线

# service.status.recovering
source: Recovering
zh_hans: 恢复中

# service.status.runtime_mismatch
source: Mismatch
zh_hans: 不匹配

# service.status.unavailable
source: Unavailable
zh_hans: 不可用

# service.toolbar.checking
source: Checking service
zh_hans: 服务检查中

# service.toolbar.failure
source: Service issue
zh_hans: 服务异常

# service.toolbar.healthy
source: Service healthy
zh_hans: 服务正常

# service.toolbar.offline
source: Service offline
zh_hans: 服务离线

# service.toolbar.recovering
source: Recovering service
zh_hans: 服务恢复中

# service.toolbar.runtime_mismatch
source: Compatibility issue
zh_hans: 兼容性不匹配

# session_group.expanded
source: Expanded
zh_hans: 展开

# session_group.stacked
source: Stacked
zh_hans: 堆叠

# studio.action.cancel_task
source: Cancel Task
zh_hans: 取消任务

# studio.action.restart
source: Start Over
zh_hans: 重新开始

# studio.action.resume
source: Continue
zh_hans: 继续制作

# studio.action.cancelling
source: Cancelling
zh_hans: 正在取消

# studio.action.new
source: Create New Pet
zh_hans: 制作新宠物

# studio.action.start
source: Create Pet
zh_hans: 开始制作

# studio.authored_timing_summary.format
source: %d frames across %d actions · authored per-frame timing
zh_hans: %d 帧 · %d 个动作 · 逐帧创作时序

# studio.baseline.animation
source: Animation
zh_hans: 动画

# studio.baseline.keep_contract
source: Keep existing contract
zh_hans: 保持现有合同

# studio.baseline.pet_id
source: Pet ID
zh_hans: 宠物 ID

# studio.baseline.quality
source: Quality
zh_hans: 画质

# studio.baseline.restoring
source: Restoring Baseline
zh_hans: 基线正在恢复

# studio.baseline.restoring_detail
source: The submitted validated baseline appears after PetCore restores the session.
zh_hans: PetCore 恢复会话后会显示已提交的校验基线。

# studio.baseline.safety
source: Assets being generated do not replace this preview. A new revision is committed atomically only after validation succeeds.
zh_hans: 生成中的资源不会替换此预览；只有校验成功后才原子提交新 revision。

# studio.baseline.target_state
source: Target state
zh_hans: 目标状态

# studio.baseline.title
source: Submitted Baseline
zh_hans: 当前已提交基线

# studio.baseline.unavailable_detail
source: The exact submitted revision could not be validated. The current pet preview is not substituted.
zh_hans: 无法校验已提交的确切 revision；不会用当前宠物预览替代。

# studio.baseline.unavailable_title
source: Baseline Preview Unavailable
zh_hans: 基线预览不可用

# studio.baseline.verified
source: Verified
zh_hans: 已验证

# studio.brief.description_example
source: Example: A gentle fox whose tail glows like a data stream while tools run.
zh_hans: 例如：一只温和的小狐狸，执行工具时尾巴像数据流一样发光。

# studio.brief.description_heading
source: Appearance, personality, and motion
zh_hans: 外观、气质和动作

# studio.brief.description_label
source: Pet description
zh_hans: 宠物描述

# studio.brief.description_required
source: Add a description to start creating.
zh_hans: 填写描述后才能开始制作

# studio.brief.high_quality_unsupported
source: High-resolution pets are ready to use after import, but the built-in Codex Studio can create or revise only Low and Standard packages.
zh_hans: 高分辨率宠物包导入后可以直接使用，但 App 内置 Codex Studio 仅支持制作或修改标清与标准宠物包。

# studio.brief.new_pet
source: New Pet
zh_hans: 新宠物

# studio.brief.quality_contract_format
source: %@ · 9 authored actions · Animation timing is fixed per revision
zh_hans: %@ · 9 个创作动作 · 动画时序随 revision 固定

# studio.brief.quality_heading
source: Output Quality
zh_hans: 输出画质

# studio.brief.reference_item_format
source: Reference image %d
zh_hans: 参考图 %d

# studio.brief.references_contract
source: Up to 4 PNG, JPG, or WebP images · 20 MiB each · 40 MiB total · 16 MP each
zh_hans: 最多 4 张 PNG、JPG 或 WebP · 单张 20 MiB · 总计 40 MiB · 单张 1600 万像素

# studio.brief.references_drop_count_format
source: %d selected · Add more
zh_hans: 已选择 %d 张，继续添加

# studio.brief.references_drop_empty
source: Drop images here, or choose files
zh_hans: 拖入图片，或点按选择

# studio.brief.references_heading
source: Reference Images (Optional)
zh_hans: 参考图（可选）

# studio.brief.references_issue.invalid_content
source: The file contents do not match a valid PNG, JPG, or WebP image.
zh_hans: 文件内容不是有效且格式匹配的 PNG、JPG 或 WebP 图片。

# studio.brief.references_issue.reselection_required_format
source: Select %d reference image(s) again before retrying.
zh_hans: 重试前请重新选择 %d 张参考图。

# studio.brief.references_issue.too_large
source: Each reference image must be 20 MiB or smaller.
zh_hans: 每张参考图不得超过 20 MiB。

# studio.brief.references_issue.too_many
source: You can add at most 4 reference images.
zh_hans: 参考图最多可添加 4 张。

# studio.brief.references_issue.too_many_pixels
source: Each reference image must contain no more than 16 megapixels.
zh_hans: 每张参考图不得超过 1600 万像素。

# studio.brief.references_issue.total_too_large
source: Reference images must total 40 MiB or less.
zh_hans: 参考图总大小不得超过 40 MiB。

# studio.brief.references_issue.unavailable
source: That reference image is unavailable or unreadable.
zh_hans: 这张参考图不可用或无法读取。

# studio.brief.references_issue.unsupported
source: Use a PNG, JPG, or WebP reference image.
zh_hans: 请选择 PNG、JPG 或 WebP 参考图。

# studio.brief.references_panel_message
source: Choose PNG, JPG, or WebP images for character appearance or style reference.
zh_hans: 选择用于角色形象或风格参考的 PNG、JPG 或 WebP 图片。

# studio.brief.references_panel_title
source: Choose Reference Images
zh_hans: 选择参考图

# studio.brief.references_privacy
source: Images are copied safely into the current task. The UI and exported metadata never expose original paths.
zh_hans: 图片会先安全复制到当前任务目录；界面和导出元数据不会暴露原始路径。

# studio.brief.references_remove
source: Remove reference image
zh_hans: 移除参考图

# studio.brief.style_heading
source: Style
zh_hans: 风格

# studio.brief.submitted
source: Submitted
zh_hans: 已提交

# studio.codex.checking_detail
source: Checking whether Codex App Server is available. Creation stays disabled until the check completes.
zh_hans: 正在检查本机 Codex App Server 是否可用；检查完成前不能发起制作。

# studio.codex.checking_title
source: Checking Codex
zh_hans: 正在检查 Codex

# studio.codex.conversation_empty
source: No Codex conversation content
zh_hans: 暂无 Codex 会话内容

# studio.codex.conversation_latest
source: Jump to latest
zh_hans: 跳到最新内容

# studio.codex.conversation_title
source: Codex Conversation
zh_hans: Codex 会话内容

# studio.codex.conversation_waiting
source: Waiting for Codex conversation content…
zh_hans: 正在等待 Codex 会话内容…

# studio.codex.missing_detail
source: Install Codex with App Server support, then reopen this page. Pet creation cannot start until Codex is available.
zh_hans: 请安装支持 App Server 的 Codex 后重新打开此页面；Codex 可用前不能发起宠物制作。

# studio.codex.missing_title
source: Codex Is Required
zh_hans: 需要安装 Codex

# studio.codex.unavailable_detail
source: Codex App Server did not respond to its local readiness check. Pet creation remains disabled.
zh_hans: Codex App Server 未通过本地可用性检查，当前不能发起宠物制作。

# studio.codex.unavailable_title
source: Codex Is Unavailable
zh_hans: Codex 暂不可用

# studio.field.description
source: Description
zh_hans: 描述

# studio.field.quality
source: Quality
zh_hans: 画质

# studio.field.references
source: Reference images
zh_hans: 参考图

# studio.field.style
source: Style
zh_hans: 风格

# studio.message.create_requested_format
source: Create a %@ desktop pet from this brief.
zh_hans: 按当前需求制作一个%@桌宠。

# studio.message.retry_create_format
source: Retry this brief as a %@ desktop pet.
zh_hans: 按更新后的需求重试制作一个%@桌宠。

# studio.message.retry_modify
source: Retry the pet edit while preserving the same pet ID.
zh_hans: 重试宠物修改，并继续保留同一宠物 ID。

# studio.message.start_create_failed
source: Pet creation could not start. Your brief is still available to edit and retry.
zh_hans: 宠物制作未能启动；当前需求仍可编辑并重试。

# studio.message.start_modify_failed
source: Pet editing could not start. The current revision remains unchanged.
zh_hans: 宠物修改未能启动；当前 revision 保持不变。

# studio.message.you
source: You
zh_hans: 你

# studio.page.modify_format
source: Revise %@
zh_hans: 修改 %@

# studio.page.modify_session
source: AI Revision Session
zh_hans: AI 修改会话

# studio.page.title
source: AI Pet Maker
zh_hans: AI 宠物制作

# studio.preview_repair.detail
source: Creation finished, but the result is not ready to use until its real animation preview is available.
zh_hans: 创作已完成，但在真实动画预览可用前，这只桌宠还不能启用。

# studio.preview_repair.missing_detail
source: Creation finished, but the result pet is not present in the current library snapshot. Refresh or review diagnostics before using it.
zh_hans: 创作已完成，但当前宠物库快照中没有结果桌宠。请先刷新或查看诊断，再启用它。

# studio.preview_repair.title
source: Generated · Preview needs repair
zh_hans: 已生成 · 预览需要修复

# studio.reply.cancelled
source: Task cancelled
zh_hans: 任务已取消

# studio.reply.cancelling
source: Cancelling task
zh_hans: 正在取消任务

# studio.reply.failed
source: Retry before replying
zh_hans: 重试后可继续回复

# studio.reply.idle
source: Start creating before replying
zh_hans: 开始制作后可回复

# studio.reply.running
source: Task in progress
zh_hans: 任务进行中

# studio.reply.send
source: Send Reply
zh_hans: 发送回复

# studio.reply.succeeded
source: Describe another adjustment
zh_hans: 继续描述调整意见

# studio.reply.waiting
source: Reply to the AI to continue
zh_hans: 回复 AI 的问题后继续

# studio.runtime.checkpoint_format
source: %d continuations
zh_hans: 已续接 %d 次

# studio.runtime.current_action
source: Current action
zh_hans: 当前动作

# studio.runtime.elapsed_format
source: Running %@
zh_hans: 已运行 %@

# studio.runtime.heartbeat_healthy_format
source: Heartbeat healthy · %@
zh_hans: 心跳正常 · %@

# studio.runtime.heartbeat_pending
source: Waiting for first heartbeat
zh_hans: 等待首个心跳

# studio.runtime.heartbeat_stale_format
source: No heartbeat for a while · %@
zh_hans: 长时间无心跳 · %@

# studio.runtime.heartbeat_waiting_format
source: Waiting for Codex update · %@
zh_hans: 等待 Codex 更新 · %@

# studio.runtime.last_update_format
source: Last update · %@
zh_hans: 最后更新 · %@

# studio.session.resume_accepted
source: Continuing from the original task workspace
zh_hans: 已从原任务工作区继续制作

# studio.session.resume_failed_format
source: Couldn’t continue: %@
zh_hans: 继续制作失败：%@

# studio.session.resume_starting
source: Restoring the original task and Codex conversation
zh_hans: 正在恢复原任务与 Codex 会话

# studio.session.resume_unavailable
source: This task can’t be continued
zh_hans: 当前任务无法继续制作

# studio.session.cancel_confirm.action
source: Cancel Task
zh_hans: 取消任务

# studio.session.cancel_confirm.detail
source: Cancel immediately interrupts the current Codex turn. Files already written to the workspace stay in history, but continuing later requires a new task.
zh_hans: 取消会立即中断当前 Codex turn。已写入工作区的素材会保留，但之后需要重新开始一个新任务。

# studio.session.cancel_confirm.title
source: Cancel this task?
zh_hans: 确认取消当前任务？

# studio.session.legacy_checkpoint_failure
source: This task stopped at the old fixed continuation limit; the Codex App Server connection did not fail. The original job, conversation, assets, and passed QA are preserved. Choose Continue to resume from the existing workspace.
zh_hans: 任务由旧版固定续接次数上限停止，并非 Codex App Server 连接故障。原 job、Codex 会话、素材和已通过 QA 均已保留；可点击“继续制作”从当前工作区接着运行。

# studio.session.restart_confirm.action
source: Create New Task
zh_hans: 创建新任务

# studio.session.restart_confirm.detail
source: This creates a new job and Codex conversation. The old task, assets, and QA records remain in history, but are not reused automatically.
zh_hans: 这会创建新的 job 和 Codex 会话；旧任务、素材和 QA 记录仍会保留在历史中，但不会自动复用。

# studio.session.restart_confirm.title
source: Start over from scratch?
zh_hans: 从零重新开始？

# studio.session.cancelled_detail
source: Unvalidated assets were discarded. The pet library did not change.
zh_hans: 未验证资产已丢弃，宠物库内容没有改变。

# studio.session.cancelled_title
source: Task Cancelled
zh_hans: 任务已取消

# studio.session.cancelling_detail
source: The current revision will remain unchanged.
zh_hans: 当前 revision 会保持不变。

# studio.history.brief
source: Brief
zh_hans: 制作需求

# studio.history.created
source: Created
zh_hans: 创建时间

# studio.history.detail_title
source: Task Details
zh_hans: 任务详情

# studio.history.empty
source: No creation tasks yet. New, failed, and cancelled tasks will appear here.
zh_hans: 暂无制作任务；新任务、失败任务和已取消任务都会保留在这里。

# studio.history.latest_codex
source: Latest Codex Excerpt
zh_hans: 最新 Codex 摘要

# studio.history.load_failed
source: Creation history is temporarily unavailable.
zh_hans: 制作记录暂时不可用。

# studio.history.loading
source: Loading creation history…
zh_hans: 正在加载制作记录…

# studio.history.message_count_format
source: %d recorded message(s)
zh_hans: 共记录 %d 条消息

# studio.history.no_codex
source: No bounded Codex excerpt was recorded for this task.
zh_hans: 此任务没有已记录的受限 Codex 摘要。

# studio.history.open
source: View History
zh_hans: 查看记录

# studio.history.open_chatgpt
source: View Full Conversation in ChatGPT
zh_hans: 在 ChatGPT 中查看完整会话

# studio.history.progress
source: Key Progress
zh_hans: 关键进度

# studio.history.result
source: Result
zh_hans: 制作结果

# studio.history.session.archived
source: This conversation is archived. Restore it in ChatGPT before opening it here.
zh_hans: 此会话已归档；请先在 ChatGPT 中恢复后再从这里打开。

# studio.history.session.available
source: The persistent conversation exists and is available to open.
zh_hans: 持久会话存在且当前可以打开。

# studio.history.session.missing
source: The saved conversation could not be found.
zh_hans: 未找到已记录的会话。

# studio.history.session.not_created
source: This task did not create a ChatGPT conversation.
zh_hans: 此任务尚未创建 ChatGPT 会话。

# studio.history.session.open_failed
source: ChatGPT could not open this conversation
zh_hans: ChatGPT 未能打开此会话

# studio.history.session.opened
source: Opened the Pet Studio conversation in ChatGPT
zh_hans: 已在 ChatGPT 中打开 Pet Studio 会话

# studio.history.session.unavailable
source: ChatGPT conversation status could not be verified right now.
zh_hans: 当前无法校验 ChatGPT 会话状态。

# studio.history.summary_format
source: %d saved task(s)
zh_hans: 已保存 %d 个任务

# studio.history.task_id
source: Task ID
zh_hans: 任务 ID

# studio.history.title
source: Creation History
zh_hans: 制作历史

# studio.history.transcript_hint
source: This page keeps the task facts and a bounded excerpt. Open ChatGPT for the complete conversation.
zh_hans: 本页保留任务必要信息和受限摘要；完整会话请前往 ChatGPT 查看。

# studio.history.truncated
source: Showing the newest saved tasks.
zh_hans: 当前显示最新保存的任务。

# studio.history.updated
source: Updated
zh_hans: 更新时间

# studio.session.create
source: Creation Session
zh_hans: 制作会话

# studio.session.failed_detail
source: You can retry. Submitted input and the current revision for a modification remain unchanged.
zh_hans: 可以重试；已提交输入与修改任务的当前 revision 都保持不变。

# studio.session.failed_title
source: Creation Incomplete
zh_hans: 制作未完成
